public class Main {
    public static void main(String[] args) {
        //Задание № 1
    int clientOS = 0;
    if (clientOS == 0) {
        System.out.println("Установите версию приложения для iOS по ссылке...");}
    if (clientOS != 1) {
        System.out.println("Установите версию приложениядля Android по ссылке...");}

        //Задание № 2

    }

}